# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "keith/formulae"
tap "jesseduffield/lazygit"
tap "robotsandpencils/made"
tap "twostraws/brew"
tap "dduan/formulae"
brew "mas"

# Terminal
brew "zsh"
brew "zsh-completions"
brew "ripgrep"
brew "has"
brew "gpg"

# Git
brew "git"
brew "git-lfs"
brew "git-recent"
brew "gh" # GitHub CLI
brew "act" # Run GitHub actions locally
brew "jesseduffield/lazygit/lazygit" # Simple terminal UI for git commands
brew "keith/formulae/git-pile" # Git extension to manage stacked commits

# iOS / Swift
brew "twostraws/brew/sitrep"
brew "swiftformat"
brew "swiftlint"
brew "xcbeautify"
brew "xcodegen"
brew "xcodes"
brew "clang-format"
brew "yamllint"
brew "dduan/formulae/drstring"

# Languages
brew "python-setuptools"
# brew "python@3.11", link: false
# brew "python@3.10", link: false
# brew "python@3.8", link: false
# brew "python@3.9"
brew "pylint"
brew "node"

# Other
brew "imagemagick" # Image processing
brew "cmake" # Cross-platform make
brew "aria2" # Download manager
brew "unxip" # Extract .xip files
brew "libxml2" # XML parser
brew "dockutil" # Manage dock items

# Lyft
tap "lyft/localdevtools", "git@github.com:lyft/localdevtools"
tap "lyft/lyft-ios-runner", "git@github.com:lyft/lyft-ios-runner.git"
tap "lyft/private-formulae"
brew "lyft/localdevtools/aws-okta"
brew "lyft/localdevtools/protoc-gen-lyftpython"
brew "lyft/localdevtools/protoc-gen-lyftswift"
brew "lyft/localdevtools/protoc-gen-pynamodb"
brew "lyft/localdevtools/idltools"
brew "lyft/localdevtools/kubernetes-cli@1.22"
brew "lyft/localdevtools/lyft-gitwrapper"
brew "lyft/localdevtools/lyftdev"
brew "lyft/localdevtools/lyftdevtools"
brew "lyft/localdevtools/python-310-bundle-arm64"
brew "lyft/localdevtools/python-311-bundle-arm64"
brew "lyft/localdevtools/python-bundle-arm64"
brew "lyft/lyft-ios-runner/runlyft", args: ["HEAD"]
brew "lyft/private-formulae/gitstack", args: ["HEAD"], link: false
brew "getsentry/tools/sentry-cli"

# Applications
cask "google-chrome"
cask "setapp"
cask "rancher"
cask "kdiff3"
cask "ghostty"
cask "iterm2"
cask "xcodes"
cask "fork"
cask "appcleaner"
cask "quicken"
cask "visual-studio-code"
cask "1password@beta"
cask "1password-cli"
cask "steermouse"
cask "shapr3d"
cask "bambu-studio"
cask "github-copilot-for-xcode"
cask "alfred"
cask "todoist"
cask "reveal"
cask "home-assistant"
cask "slack"
cask "charles"

# App Store
mas "Pixelmator Pro", id: 1289583905
mas "Soulver", id: 1508732804
mas "TestFlight", id: 899247664
mas "WhatsApp Messenger", id: 310633997
mas "xScope", id: 889428659
mas "RocketSim", id: 1504940162
mas "Contrast", id: 1254981365
mas "DrString", id: 1523251484
mas "WordService", id: 899972312
mas "Things 3", id: 904280696
mas "Reeder", id: 880001334
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "The Unarchiver", id: 425424353
mas "Speedtest", id: 1153157709
mas "QuickShade", id: 931571202
mas "Hand Mirror", id: 1502839586
mas "Paprika", id: 1303222628
mas "Tot", id: 1491071483
mas "In Your Face", id: 1476964367
mas "Tripsy", id: 1429967544

# SetApp
# mas "Spark", id: 1176895641
# mas "Yoink", id: 457622435
# mas "Paste", id: 
# mas "Mosaic"
# mas "iStatMenus"