# Check diff with: brew bundle cleanup --file="$DOTFILES_DIR/Brewfile"

# Taps
tap "homebrew/bundle"
tap "buo/cask-upgrade" # Upgrade casks with "brew cu"
tap "robotsandpencils/made"
tap "twostraws/brew"
brew "mas"

# Terminal
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "ripgrep"
brew "has"
brew "gpg"
brew "gnupg"
brew "fzf" # Fuzzy file search
brew "fd"
brew "bat"
brew "eza" # Modern, maintained replacement for ls/exa
brew "tmux"
brew "vim"
brew "rename"
brew "micro"
brew "yazi"
brew "keith/formulae/tag"
brew "sachaos/todoist/todoist"
brew "findutils"
brew "wget"

# Git
tap "keith/formulae"
brew "git"
brew "git-lfs"
brew "git-extras"
brew "git-recent"
brew "pre-commit"
brew "diff-so-fancy"
brew "gh" # GitHub CLI
brew "act" # Run GitHub actions locally
brew "lazygit" # Simple terminal UI for git commands
brew "keith/formulae/git-pile", args: ["HEAD"] # Git extension to manage stacked commits

# iOS / Swift
tap "dduan/formulae"
brew "swiftformat"
brew "swiftlint"
brew "xcbeautify"
brew "xcodegen"
brew "xcodes"
brew "clang-format"
brew "yamllint"
brew "vapor"
brew "dduan/formulae/drstring"

# Languages
brew "python-setuptools"
brew "python@3.12", link: false
brew "python@3.11", link: false
brew "python@3.10"
# brew "python@3.9", link: false
brew "pylint"
brew "php"
brew "node"
brew "fnm" # Node version manager
brew "ruby"
brew "rbenv"
brew "yarn"
brew "go"
brew "postgresql"

# Other
brew "coreutils" # Those that come with macOS are outdated
brew "pkg-config" # Package compiler and linker metadata toolkit
brew "cmake" # Cross-platform make
brew "unxip" # Extract .xip files
brew "libxml2" # XML parser
brew "dockutil" # Manage dock items
brew "imagemagick" # Image processing
brew "webp" # Image format
brew "jpeg-xl" # Image format
brew "libpng" # Image format
brew "curl" # Download files
brew "aria2" # Download manager
brew "trufflehog" # Scan for secrets
brew "pillow" # Python image library
brew "ical-buddy" # Calendar management
# brew "copilot" # This is not the copilot you want

# Lyft
tap "lyft/localdevtools", "git@github.com:lyft/localdevtools"
tap "lyft/lyft-ios-runner", "git@github.com:lyft/lyft-ios-runner.git"
tap "getsentry/tools"
brew "lyft/localdevtools/lyftdev"
brew "lyft/localdevtools/lyftdevtools"
brew "lyft/localdevtools/lyft-gitwrapper"
brew "lyft/localdevtools/lyft-dev-cli"
brew "lyft/localdevtools/python-310-bundle-arm64"
brew "lyft/localdevtools/python-311-bundle-arm64"
brew "lyft/localdevtools/python-bundle-arm64"
brew "lyft/localdevtools/protoc-gen-lyftpython"
brew "lyft/localdevtools/protoc-gen-lyftswift"
brew "lyft/localdevtools/protoc-gen-pynamodb"
brew "lyft/localdevtools/infrahelpcli"
brew "lyft/localdevtools/run-piptools"
brew "lyft/localdevtools/aws-okta"
brew "lyft/localdevtools/idltools"
brew "lyft/localdevtools/bubble"
brew "lyft/lyft-ios-runner/runlyft", args: ["HEAD"]
brew "getsentry/tools/sentry-cli"
brew "bazel"
cask "bubble"

# Applications
cask "google-chrome"
cask "setapp"
cask "rancher"
cask "jordanbaird-ice" # Manage menu bar items
cask "kdiff3"
cask "ghostty"
cask "iterm2"
cask "xcodes"
cask "fork"
cask "jordanbaird-ice" # Manage menu bar items
cask "appcleaner"
cask "quicken"
cask "cursor"
cask "visual-studio-code"
cask "1password@beta"
cask "1password-cli"
cask "yaak"
cask "karabiner-elements"
cask "shapr3d"
cask "bambu-studio"
cask "github-copilot-for-xcode"
cask "alfred"
cask "todoist"
cask "reveal"
cask "home-assistant"
cask "slack"
cask "charles"
cask "figma"
cask "sf-symbols"
cask "gpg-suite"
cask "imageoptim"
cask "yubico-authenticator"
cask "moom" # Window management
cask "chatgpt"
cask "bruno" # API client
cask "textbuddy"
cask "limitless" # Personal AI-powered transcription and notetaking service

# App Store
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Boop", id: 1518425043
mas "Dr String", id: 1523251484
mas "Codeface", id: 1578175415
mas "Coduo", id: 6443565833
mas "Contrast", id: 1254981365
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "DetailsPro", id: 1524366536
mas "Developer", id: 640199958
mas "Hand Mirror", id: 1502839586
mas "Home Assistant", id: 1099568401
mas "In Your Face", id: 1476964367
mas "Kaleidoscope", id: 1575557335
mas "Paprika Recipe Manager", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "QuickShade", id: 931571202
mas "Reeder", id: 1529448980
mas "RocketSim", id: 1504940162
mas "Shapr3D", id: 1091675654
mas "Soulver 3", id: 1508732804
mas "Speedtest", id: 1153157709
mas "SQLiteExplorer", id: 1616792360
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Tot", id: 1491071483
mas "Tripsy", id: 1429967544
mas "WordService", id: 899972312
mas "xScope", id: 889428659
mas "WhatsApp", id: 310633997

# SetApp
# mas "Spark", id: 1176895641
# mas "Yoink", id: 457622435
# mas "Paste", id:
# mas "Mosaic"
# mas "iStatMenus"

# VSCode
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svanimpe.stencil"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "dnicolson.binary-plist"
